
#+begin_src python :kernel sagemath :exports both
load("poc.py")
bulk_run(2048, 512-16, 8, seed=0, msb=True, correct=True, jobs=8, h=36)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
True 153578841830360776565460871189986826853164973373632578320479105356718758452159427381932213143177337096945301921281293765718566382086300854032852695990523519241157656232460770439699323536315720526644268213605121036925980706849259554941676383148415307729559362443631507745008656748885446965672606785007698111887
True 103512864376513636474747773062824627551794720347388459172866960777923367308667492574535625365825526120736506274772214670160107032347677100000293626434320603402602037211843985672418995283470262401870201221139951521891947482809804608782695918797436613127007465223173856581803745522388922787430046718629959967913
True 178159500873448785047858146484870734992863332621460210297653776096301800908201073367536274539509027012629630526622783457094579788903419762888086085686952666079012331090055050030697686445236022534872570342018920072485862664677211295305343461616455657659756316607140113356362774071141201766774646237562493723591
True 117138025394644738850556366664268317541091210761704858302818043897575542748098085610983232724765086177066357878037390676480793570028071414863214276536302883530968607742180428780455578501462713926337233581950264975388570087894001965232413327910973625826258789387392071537914938646381151975610398175704903200297
True 149639880718388132546825743075198052090813754506178381791695253957858117474248943351007906804082127327560941212348063535341716025490524113006505702721750705695098465877483543509986623568888107549418844571380655716309574062700991706168092533240446190782357580409624717202652254087588289965851156403029123681577
True 153404671292178377537112969709443674694803936315144358980489269826027528395896030694011406328429042772944447561271089295652113226023328855020136627774022073306657846659725434788695711720677537015130612304435138622263498804718918704439878428488899569605687320923120024822868022041477058088249056494213550452981
True 152981315245588931097717196842333163509534246546564913757081584521417458048151222537306190015554356178983593927068750706103494368330101610856415361124370415059570318868154088559252031999472706038396737192071345599107513045301686353294970211385648930265041131733788916513909469252143331066771811634205953224797
True 172219956390795087673574797074022674339425834422586960716694966162507137282245774712656617527391129511173214568937384540445724468649901082713149137673965206020581206728084362611592711176332174423825835441561248543199391959072523623910788825439892630851689462369218652197282195185785603697486505341992186595099
rate: 1, avg t: 7.310460874999999, max t: 8.290296
#+end_example
: (1, 7.310460874999999, 8.290296)
:END:


#+begin_src python :kernel sagemath :exports both
load("poc.py")
bulk_run(2048, 512-16, 8, seed=0, msb=True, correct=False, jobs=8, h=36)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
False 1
False 16569375372449969369216017855469854828649063030324657396502938650879248459510533855054221218682156711432354261350738947872101293388745470915766863697397712405383315737708561337641720670170514064483844080102525318654394892290011143729626685567495957927057065097329299991684157258061592518369499811586121509947489340579902368563053799814802180424975108488487403663793583917003759456374901427584274447841081420805236088876169900900817284910606245286949605432326869119849344982323213516996403363021369658769566679667844004552029749964239368029547836883707059191269354646767848088545682927516022167844646240134520627029563
False 1
False 17324910984272240201402751110221871910623989123083829184850073357643564901694159942459782026505005567652553543870216109336810264870973673934018134791980933614964544732310350711859707760611742617446835328105072887384397587301359988210423351544147331626488245366005295365756035411417032680576778789198721944404889736117782112220585037809236768845965587187715002565524432716075788379570387467933675478228925306883942524860865072609206686447369198027047387934804802119080361480468022100247211649829477366518269125553385745328609537200811822707382134115966259663717436387805708027608477004244873244610132090904252499747521
False 24719817183228916298507017764082896629256462761087899538614631382254212645240305733828761743187049454572261602940540774580236026376734272418630782013846582628311618892610819841344020024831730783392540089984599180875856245876370756219541096415980365197664849776203877727509362453161871386571989810252341751320715757790326225826835527075396740925438553124652863058010767373160299384576551755856990870583417619728146299792310181266415488231427449591437091166579831797988759876799290592949550682254708141502126317647800091038426986733384770891517912413029003616737882443759213005387927229757250443375413329648303864942627
False 27570352181969941415495372585094077084337877519989513349913280962490901912086282960660751778731809541181565757043413363253797299244392044393591770263095471762175699360399600591863083211410408983180851434531151612807310243589950852103944848064721446099244779807312135462538924471736069490981949705233157350251057985458518697552129592503414234240483934454840566714318946324062338998488269931490122257777763325788511386548365144792137202524371895581139562061458439267600588765401646254036293700988428898341312221680940576560773015762075918643012354529998118210795676502911560965576288339628518899142089570878176211544507
False 18843694578999353281729557687306263316720172973003384857773515313002677903054423571521116369935763270595546656936504796369161664392863286761315906940209400382928386157458507139371432631430263836188255432718544292170499887344727115258841455751173488221034235579150953782322029778206205879263939325067902651996698922935108188711871519264847164498049304396102297950517407345799914554306827821735067613873135421573809898200155700382189205228045773147411332372414754812834311771029334024510744688226736515592593434391993553898862533547038029125379451063598354447157227373899692758816297973673157878157590765565961654624627
False 1
rate: 0, avg t: 6.692976000000001, max t: 7.5859209999999955
#+end_example
: (0, 6.692976000000001, 7.5859209999999955)
:END:


#+begin_src python :kernel sagemath :exports both
load("poc.py")
bulk_run(2048, 512-16, 8, seed=0, msb=True, correct=True, jobs=8, h=36, verbose=True)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
h: 36, u: 18
h: 36, u: 18
h: 36, u: 18
True 153578841830360776565460871189986826853164973373632578320479105356718758452159427381932213143177337096945301921281293765718566382086300854032852695990523519241157656232460770439699323536315720526644268213605121036925980706849259554941676383148415307729559362443631507745008656748885446965672606785007698111887
h: 36, u: 18
True 178159500873448785047858146484870734992863332621460210297653776096301800908201073367536274539509027012629630526622783457094579788903419762888086085686952666079012331090055050030697686445236022534872570342018920072485862664677211295305343461616455657659756316607140113356362774071141201766774646237562493723591
True 103512864376513636474747773062824627551794720347388459172866960777923367308667492574535625365825526120736506274772214670160107032347677100000293626434320603402602037211843985672418995283470262401870201221139951521891947482809804608782695918797436613127007465223173856581803745522388922787430046718629959967913
h: 36, u: 18
True 117138025394644738850556366664268317541091210761704858302818043897575542748098085610983232724765086177066357878037390676480793570028071414863214276536302883530968607742180428780455578501462713926337233581950264975388570087894001965232413327910973625826258789387392071537914938646381151975610398175704903200297
True 149639880718388132546825743075198052090813754506178381791695253957858117474248943351007906804082127327560941212348063535341716025490524113006505702721750705695098465877483543509986623568888107549418844571380655716309574062700991706168092533240446190782357580409624717202652254087588289965851156403029123681577
h: 36, u: 18
True 153404671292178377537112969709443674694803936315144358980489269826027528395896030694011406328429042772944447561271089295652113226023328855020136627774022073306657846659725434788695711720677537015130612304435138622263498804718918704439878428488899569605687320923120024822868022041477058088249056494213550452981
h: 36, u: 18
True 152981315245588931097717196842333163509534246546564913757081584521417458048151222537306190015554356178983593927068750706103494368330101610856415361124370415059570318868154088559252031999472706038396737192071345599107513045301686353294970211385648930265041131733788916513909469252143331066771811634205953224797
h: 36, u: 18
True 172219956390795087673574797074022674339425834422586960716694966162507137282245774712656617527391129511173214568937384540445724468649901082713149137673965206020581206728084362611592711176332174423825835441561248543199391959072523623910788825439892630851689462369218652197282195185785603697486505341992186595099
rate: 1, avg t: 6.901490374999999, max t: 7.521823999999999
#+end_example
: (1, 6.901490374999999, 7.521823999999999)
:END:

* Symbolic

#+begin_src python :kernel sagemath :exports both
var("X,q_0,N")
h = 4
u = 2
f_ = []
for i in range(h):
    if i < u:
        f_.append(N^(u-i) * (q_0 + x)^i)
    else:
        f_.append(x^(i-u) * (q_0 + x)^u)
    print(latex(f_[-1].expand()))
#+end_src

#+RESULTS:
: N^{2}
: N q_{0} + N x
: q_{0}^{2} + 2 \, q_{0} x + x^{2}
: q_{0}^{2} x + 2 \, q_{0} x^{2} + x^{3}

